var express = require('express');
var router = express.Router();
// var mysql = require('mysql')
var query = require('../db.js');
const { buildSchema } = require('graphql')
const graphqlHTTP = require('express-graphql')
var R = require('ramda')

/* GET users listing. */
router.get('/test', function(req, res, next) {
  res.send('respond with a resource');
});
var benefit = ['五险一金','带薪年假','弹性工作','年终奖金','餐饮补贴','六险一金','免费三餐','租房补贴','带薪休假','下午茶','扁平管理','绩效奖金','高温补贴','节日福利','餐补','免费班车','员工旅游','通讯补贴','交通补贴','专业培训','补充医疗保险','补充公积金','定期体检','出国机会','周末双休','工作氛围好']

var job_edu = ['本科','高中','大专','博士','中专','硕士','初中及以下','中技']
var job = [{name:'项目经理',
           company:'樊梦装饰设计工程（广州）有限公司',
           salary:'12万-15万/月',
           require:'中专|无经验',
           addr:'番禹区',
           welfare:['环境好','年终奖','包食宿','管理规范','有提成']
       },
       {
           name:'网络运营',
           company:'富平县德信人力资源有限公司',
           salary:'面议',
           require:'学历不限|经验不限',
           addr:'富平县',
           welfare:[]
       }]

var ind = [{"type":"餐饮","index":["服务员","送餐员","厨师/厨师长","后厨","传菜员","配菜/打荷","洗碗工","面点师","茶艺师","迎宾/接待","大堂经理/领班","餐饮管理","学徒","杂工","咖啡师","预订员"]},{"type":"家政保洁/安保","index":["保洁","保姆","月嫂","育婴师/保育员","洗衣工","钟点工","保安","护工","送水工"]},{"type":"美容/美发","index":["发型师","美发助理/学徒","洗头工","美容导师","美容师","美容助理/学徒","化妆师","美甲师","宠物美容","美容店长","美容/瘦身顾问","彩妆培训师","美体师"]},{"type":"酒店/旅游","index":["酒店前台","客房服务员","楼面经理","行李员","救生员","酒店管理","订票员","导游","计调","签证专员","旅游顾问"]},{"type":"娱乐/休闲","index":["酒吧服务员","娱乐厅服务员","礼仪/迎宾","主持人","调酒师","音效师","灯光师","摄影师/摄像师","影视/后期制作","配音员","放映员"]},{"type":"保健按摩","index":["按摩师","足疗师","搓澡工","针灸推拿"]},{"type":"运动健身","index":["健身教练","瑜伽教练","舞蹈老师","游泳教练","台球教练","高尔夫球助理"]},{"type":"人事/行政/后勤","index":["文员","前台/总机/接待","人事专员/助理","人事经理/主管","人事总监","行政专员/助理","行政经理/主管","行政总监","经理助理/秘书","薪酬/绩效/员工关系","猎头顾问","后勤","培训专员/助理","培训经理/主管","招聘专员/助理","招聘经理/主管"]},{"type":"司机","index":["商务司机","客运司机","货运司机","出租车司机","班车司机","特种车司机","驾校教练/陪练"]},{"type":"高级管理","index":["CEO/总裁/总经理","首席运营官COO","首席财务官CFO","首席技术官CTO","副总裁/副总经理","总裁助理/总经理助理","总监","分公司经理","合伙人"]},{"type":"销售","index":["销售代表","销售助理","销售经理/主管","销售总监","电话销售","销售支持","汽车销售","医药代表","医疗器械销售","网络销售","区域销售","渠道专员","渠道经理/总监","客户经理/主管","大客户经理","团购业务员/经理","会籍顾问"]},{"type":"客服","index":["客服专员/助理","客服经理/主管","客服总监","售前/售后服务","电话客服","客户关系管理"]},{"type":"贸易/采购","index":["外贸专员/助理","外贸经理/主管","采购员","采购助理","采购经理/总监","报关员","商务专员/经理","买手"]},{"type":"超市/百货/零售","index":["店员/营业员","收银员","促销/导购员","理货员/陈列员","防损员/内保","店长/卖场经理","招商经理/主管","奢侈品业务","品类管理","食品加工/处理","督导"]},{"type":"淘宝职位","index":["网店店长","淘宝客服","淘宝美工","店铺文案编辑","店铺推广","活动策划"]},{"type":"房产中介","index":["房产经纪人","置业顾问","房产店长/经理","房产店员/助理","房产客服","房产内勤","房产评估师","房产开发/策划","其他房产职位"]},{"type":"市场/媒介/公关","index":["市场专员/助理","市场经理/总监","市场拓展","市场调研","市场策划","媒介专员/助理","媒介经理/主管","会务会展专员/经理","品牌专员/经理","公关专员/助理","公关经理/主管","企划经理/主管"]},{"type":"广告/会展/咨询","index":["广告文案","创意指导/总监","广告设计/制作","广告创意","媒介策划/管理","会展策划/设计","婚礼策划师","咨询顾问","咨询经理/主管","客户主管/专员","企业策划"]},{"type":"美术/设计/创意","index":["美编/美术设计","服装设计","家具/家居用品设计","平面设计","美术指导","店面/陈列/展览设计","工艺/珠宝设计","多媒体/动画设计","产品/包装设计","装修装潢设计","CAD设计/制图"]},{"type":"普工/技工","index":["普工","综合维修工","制冷/水暖工","电工","木工","钳工","切割/焊工","钣金工","油漆工","缝纫工","锅炉工","车工/铣工","铲车/叉车工","铸造/注塑/模具工","电梯工","操作工","包装工","手机维修","水泥工","钢筋工","管道工","瓦工","组装工","样衣工","染工","纺织工","印花工","压熨工"]},{"type":"生产管理/研发","index":["质量管理","总工程师/副总工程师","设备管理维护","工艺设计","车间主任","生产计划","化验/检验","厂长/副厂长","生产总监","维修工程师","工业工程师","材料工程师","技术工程师","生产主管/组长"]},{"type":"物流/仓储","index":["物流专员/助理","物流经理/主管","物流总监","调度员","快递员","仓库管理员","仓库经理/主管","装卸/搬运工","供应链管理","单证员","国际货运"]},{"type":"服装/纺织/食品","index":["服装设计师","纺织品设计师","服装打样/制版","生产管理","样衣工","食品/饮料研发/检验","板房/底格出格师","电脑放码员","纸样师/车板工"]},{"type":"质控/安防","index":["质量检验员/测试员","质量管理/测试经理","测试工程师","安全消防","认证工程师/审核员","安全管理"]},{"type":"汽车制造/服务","index":["汽车设计工程师","装配工艺工程师","汽车/摩托车修理","汽车机械工程师","汽车电子工程师","4S店管理","汽车检验/检测","汽车美容","二手车评估师","发动机/总装工程师","安全性能工程师","理赔专员/顾问","洗车工","停车管理员","加油站工作员","轮胎工"]},{"type":"计算机/互联网/通信","index":["技术总监/经理","技术支持/维护","技术专员/助理","软件工程师","程序员","硬件工程师","质量工程师","测试工程师","系统架构师","数据库管理/DBA","游戏设计/开发","网页设计/制作","语音/视频/图形","项目经理/主管","产品经理/专员","网站运营","网站编辑","网络管理员","网络与信息安全工程师","实施工程师","通信技术工程师","网站策划"]},{"type":"电子/电气","index":["自动化工程师","电子/电气工程师","电路工程师/技术员","无线电工程师","测试/可靠性工程师","产品工艺/规划工程师","音频/视频工程师","灯光/照明设计工程师","研发工程师","电子/电器维修"]},{"type":"机械/仪器仪表","index":["机电工程师","机械工程师","研发工程师","测试/可靠性工程师","版图设计工程师","仪器/仪表/计量"]},{"type":"法律","index":["律师/法律顾问","律师助理","法务专员/主管","产权/专利顾问","合规管理"]},{"type":"教育培训","index":["教师/助教","家教","幼教/早教","培训师/讲师","培训策划","培训助理","教学/教务管理","教育产品开发","学术研究/科研","招生/课程顾问","校长","野外拓展训练师"]},{"type":"翻译","index":["英语翻译","日语翻译","韩语翻译","法语翻译","俄语翻译","德语翻译","西班牙语翻译","意大利语翻译","葡萄牙语翻译","阿拉伯语翻译","小语种翻译"]},{"type":"编辑/出版/印刷","index":["总编/副总编/主编","编辑/撰稿","记者/采编","出版/发行","排版设计/制作","印刷操作","装订/烫金"]},{"type":"财务/审计/统计","index":["财务经理/主管","财务总监","会计/会计师","财务/会计助理","出纳","审计专员/助理","审计经理/主管","统计员","税务专员/助理","税务经理/主管","财务分析员","成本管理员"]},{"type":"金融/银行/证券/投资","index":["证券/期货/外汇经纪人","证券经理/总监","证券分析/金融研究","信用卡/银行卡业务","银行经理/主任","银行会计/柜员","信贷管理/资信评估","资产评估","担保/拍卖/典当","拍卖师","外汇/基金/国债经理人","投资/理财顾问","融资专员","融资经理/总监","风险管理/控制","股票交易员"]},{"type":"保险","index":["储备经理人","保险客户经理","车险专员","保险内勤","保险培训师","保险客服","保险顾问","保险经纪人","保险项目经理","保险精算师","保险其他职位"]},{"type":"医院/医疗/护理","index":["医生","保健医生","心理医生","护士/护理","护理主任/护士长","导医","药剂师","理疗师","医药质检","医疗管理","美容整形师","验光师","营养师","宠物护理/兽医"]},{"type":"制药/生物工程","index":["医药研发/生产/注册","临床研究/协调","生物工程/生物制药","医疗器械研发/维修"]},{"type":"环保","index":["污水处理工程师","环境工程技术","环境管理/保护","环保技术","EHS管理","环保工程师","环保检测","水质检测员","环境绿化"]},{"type":"建筑","index":["工程项目管理","工程监理","建筑工程师/总工","土木/土建工程师","造价师/预算师","幕墙工程师","安防工程师","安全管理/安全员","道路桥梁技术","给排水/制冷/暖通","测绘/测量","园林/景观设计","资料员","市政工程师","综合布线/弱电"]},{"type":"物业管理","index":["物业管理员","物业维修","物业经理/主管","合共管理","招商经理/主管"]},{"type":"农/林/牧/渔业","index":["饲料业务","养殖人员","农艺师/花艺师","畜牧师","场长","养殖部主管","动物营养/饲料研发"]},{"type":"其他招聘信息","index":["其他职位"]}]
const schema = buildSchema(`
    type Job {
        name: String
        company: String
        salary: String
        require: String
        addr: String
        welfare:[String]
    }
    type Index{
        type: String
        index: [String]
    }
    type Query {
        highPay(limit:Int):[Job]
        indices:[Index]
    }
`)

async function getJob() {
    var sql = 'select job_name name,comp_name company,sala salary,job_edu.name `require`,job.job_place addr,job_place.city,benefit from job,job_place,job_edu WHERE job.job_place = job_place.id AND job.edu_id = job_edu.id';
    var data = []
    const rows = await query(sql)
    // console.log(rows)
    data = rows.map((x)=>{
        var w = x.benefit.split(",")
        x.welfare = w.map((a)=>benefit[a],w)
        return x
    },rows)
    // console.log(data)
    return data

}



const byTypeName = R.groupBy(function (row){
    return row.type_name;
})
var result = []
function deal (value,key){
    result.push({"type":key,"index":R.pluck('index_name')(value)})
}
async function getIndex(){
    var sql = 'select type_name,index_name from job_type t, job_index i where i.type_id = t.id'
    const rows = await query(sql);
    R.forEachObjIndexed(deal,byTypeName(rows))
    return result
}
// 定义查询所对应的 resolver，也就是查询对应的处理器
const root = {
    highPay:async ({limit:l}) =>{
        var j = await getJob()
        return j.slice(0,l)
    },
    indices:async() =>{
        var i = await getIndex()
        return i
    }
}

module.exports = graphqlHTTP({
    schema: schema,
    rootValue: root,
    graphiql: true
})

// query{
  
//   highPay(limit:9) {
//     name
//     company
//     salary
//     require
//     addr
//     welfare
//   }
// }

// query{
//   indices {
//     type
//     index
//   }
// }